angular.module("automap")
  .factory("$handbook", function(){
    return {
      /*  請更新 './static/api/handbook-data.json' 上的資料而非此處  */

        "catagories": [
          { "t": "法源", "color": "#9ef", "icon": "law"},
          { "t": "申請", "color": "#f99", "icon": "edit"},
          { "t": "家庭", "color": "#f93", "icon": "home"},
          { "t": "交友", "color": "#fca", "icon": "add user"},
          { "t": "計畫", "color": "#0f0", "icon": "hourglass half"},
          { "t": "學校", "color": "#cc5", "icon": "student"},
          { "t": "審議", "color": "#f66", "icon": "protect"},
          { "t": "資源", "color": "#c9c", "icon": "in cart"}
        ],
        "faqs": [
        { "q" : "不上學，合法嗎？",
          "c" : "法源",          
          "as" : [
                "教育基本法保障家長的教育選擇權和孩子的受教權。",
                "經過多年的努力，台灣非學校教育(通稱自學)已經合法，目前比日本、中國、香港、韓國，對自學都更友善、更開放。",
                "只要經過申請的手續，和過程的評鑑，就可以自訂學習計畫，不必上學。"
          ],
          "es" : [
            { "t": "體制外學校、在家自學有法源了",
              "h": "http://udn.com/news/story/6886/476385-%E9%AB%94%E5%88%B6%E5%A4%96%E5%AD%B8%…1%E5%9C%A8%E5%AE%B6%E8%87%AA%E5%AD%B8-%E6%9C%89%E6%B3%95%E6%BA%90%E4%BA%86"
            },
            { "t": "做個堂堂正正的「不在校上學」學生", 
              "h": "http://www.homeschool.tw/2014/10/blog-post.html"
            }
          ]
        },
        { "q" : "自學申請的時程是什麼時候？",
          "c" : "申請",
          "as" : [
              "在台灣要自學，要申請「非學校型態實驗教育」，你可以搜尋你們戶籍所在地教育局或處的非學校型態教育的網站，下載申請的工具包或是檔案，依照說明，完成實驗計畫，在時間內送件即可。",
              "一年有兩次，大部份縣市上學期要在4/30日前送件，下學期要申請，要在10/30日前送件。"
          ],
          "es": []
        },
        { "q" : "如何經營良好的家庭合作討論文化?",
          "c" : "家庭",
          "as" : [
            "合作討論並不只是彼此對話，要有一些前提和準備，比如願意好好聴人說話，願意幫助對方把話說清楚。",
            "所以每個人都要先學會「聆聽」。\n好好的，專注聽人把話說完、說清楚，不急著回應或評斷，這也是需要練習的事。"
          ],
          "es" : [
          {
            "t": "合作討論文化",
            "h": "https://sites.google.com/site/alearn13994229/a-03/he-zuo-tao-lun-wen-hua"
          }]
        },
        { 
          "q" : "自學對未來的出路和職場生涯有幫助嗎？",
          "c" : "計畫",
          "as" : [
            "自學是一種脈絡和節奏，內涵很多元。每家的方法不盡相同。",
            "因為可以量身打造，所以可以視自己的情況和能力，安排相關專業社群的接觸，多認識不同圈子、不同年齡層的家長、避免閉車造車，並培養專注和實現目標的習慣，這樣的自學才能對工作能力的發展有很大的幫助。"
          ]
        },
        { "q" : "時間怎麼安排好呢？",
          "c" : "計畫",
          "as" : [
            "離開學校後，健康規律的生活作息要靠自己和家庭來維持。",
            "學習和專業成長的部份，時間安排上，要能專注，不要太切割零散。"
          ],
          "es" : [
            {
              "t": "自學週課表分析",
              "h": "http://pulse.naer.edu.tw/content.aspx?type=N&sid=207"
            }, 
            {
              "t": "一萬小時定律試算機",
              "h": "http://map.alearn.org.tw/tools/10khrs"
            }]
        },
        { "q" : "在家自學，怎麼交朋友？",
          "c" : "交友",
          "as" : [
            "在家自學只是沒有每天上學，並不是一直待在家裡不出門。",
            "大部份自學家庭，都會找到孩子接觸人際的機會，依興趣、依地緣來參與社群。",
            "交友圈可能很多元，往往還能更長久，不會因為在學校的畢業或重新分班就被拆散。"
          ],
          "es": [{
            "h": "http://we.alearn.org.tw/",
            "t": "自學2.0互助地圖"
          }]
        },
        { "q" : "我家附近有人自學嗎？",
          "c" : "交友",
          "as" : [
            "您可以在自學地圖上尋找在地的自學社團，也可以上自學2.0互助地圖登錄自己和尋找夥伴，彼此認識。"
          ],
          "es": [{
            "h": "http://we.map.alearn.org.tw/",
            "t": "自學2.0互助地圖"
          }]
        },
        { "q" : "有沒有辦法一部份時間在家自學，一部份時間上學呢？",
          "c" : "學校",
          "as" : [
            "您可以跟教育局申請自學，自學計畫裡面可以將學校資源列入，比方說每週去上學三天。",
            "同時也要跟學校溝通，最好讓導師能瞭解並支持。"
          ],
          "es": []

        },
        { "q" : "除了自學社群的發展，學校教育是不是也要改革呢？",
          "c" : "學校",
          "as" : [
            "學校教育當然有要改革之處。但如果要從外部去改它，就得出力支持（如推修法、辦遊行、找支持團體、民代、法律學者等人籌備進行）。",
            "非學校教育若在法條、執行面有不合宜之處，要更改的話，也是要發起修法或行政上的檢舉申訴。",
            "這兩邊法條和執行都是分開的，無法相互比較。"
          ],
          "es": []
        },
        { "q" : "自學很花錢嗎？有沒有不花錢的方法？",
          "c" : "資源",
          "as" : [
            "您可以使用免費學習資源，像是公立圖書館、博物館、網路教材、參與網路學習社群。",
            "也可以在一些地方用換工的方式來替代學費，或是在願意栽培新人技藝的工作室當學徒。",
            "您可以在社群中向其他有經驗的自學家庭打聽，或是在家庭附近尋找。"
          ],
          "es": []

        },
        { "q" : "申請自學後，教育單位成本會撥到何處？",
          "c" : "資源",
          "as" : [
            "現況(2016)是學生教育單位成本全部撥給設籍學校。",
            "這中間當然有不盡合理之處，尚待未來的改革。"
          ],
          "es": [
            { "t": "炸蝦便當寓言", "h": "https://homeschool.hackpad.com/JnIeVmNyy7L"}
          ]
        },
        { "q" : "邊鄉部落可以自學嗎？",
          "c" : "資源",
          "as" : ["事實上有部落自學的先例，透過互助合作、耆老與家長協同傳承文化，部落自行辦學、發展共同經濟"],
          "es": [
            { "t": "八八風災後大社部落返鄉自學", "h": "http://titv.ipcf.org.tw/news-6901"},
            { "t": "司馬庫斯部落自學與共同經濟", "h": "http://www.meworks.net/meworksv2/meworks/page1.aspx?no=4073"}
          ]
        },
        { "q" : "為什麼自學要有審議?",
          "c" : "審議",
          "as" : [
            "教育基本法同時保障家長的教育選擇權和孩子的受教權，在實行條例中並明定和非學校教育和補習教育不同。",
            "教育選擇權不能無限擴大，所以需要機制來保障孩子的受教權。",
            "在更好的機制被研發出來之前，審議制是目前政府認為比較可行的方式。"
          ],
          "es": [
            { "t": "教育基本法", "h": "http://law.moj.gov.tw/LawClass/LawAll.aspx?PCode=H0020045"}
          ]
        },
        { "q" : "遇到審議委員不合理的對待怎麼辦？",
          "c" : "審議",
          "as" : [
            "一、您可以現場錄音，加上文字說明向教育局發信投訴。",
            "二、在自學社群（非學校論壇、臉書社團等）尋求支援與共同發聲"
          ],
          "es" : []
        },
        { "q" : "如何下載申請書並提出申請？",
          "c" : "申請",
          "as" : [
            "如需申請書，請聯絡你的戶籍地的縣市的「承辦單位」。",
            "各縣市公告的「實驗教育計畫」是僅供參考的範例，家長可自行設計，不一定要完全按照公告的格式撰寫。",
            "進一步資訊，可參考「保障教育選擇權聯盟」網站。"
          ],
          "es": [
            { "t": "申請書下載與各縣市承辦人", "h": "http://www.homeschool.tw/p/02-272088896371-edupe.html"}
          ]
        }]         
      };
  })
